# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [ ]:
# your code here

#### Print `temp`.

In [ ]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### Select the rows where state is New York.

In [ ]:
# your code here

#### What is the average temperature of cities in New York?

In [ ]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [ ]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [ ]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [ ]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [ ]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [3]:
# your code here
employees = pd.read_csv("employees.csv")
employees

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,2002-06-07,HR_REP,6500,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07,PR_REP,10000,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07,AC_MGR,12000,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07,AC_ACCOUNT,8300,NaN,205.0,110.0

#### Explore the data types of the `employees` dataframe. Comment your results.

In [4]:
# your code here
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   employ_id       107 non-null    int64
 1   first_name      107 non-null    object
 2   last_name       107 non-null    object
 3   email           107 non-null    object
 4   phone_number    107 non-null    object
 5   hire_date       107 non-null    object
 6   job_id          107 non-null    object
 7   salary          107 non-null    int64
 8   commission_pct  35 non-null     float64
 9   manager_id      106 non-null    float64
 10  department_id   106 non-null    float64
dtypes: float64(3), int64(2), object(6)
memory usage: 9.3+ KB

In [ ]:
"""
your comments here
il y a des null values pour commission_pct -> ca doit etre les personnes qui ne sont pas des salesperson
il y a des null values pour manager_id -> c'est le PDG
il y a un null dans department_id -> mistake

corrigé type of hire_date to datetime64

"""

In [10]:
employees[["hire_date"]] =employees[["hire_date"]].astype('datetime64')

In [24]:

employees[pd.isnull(employees["department_id"])]

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
78,178,Kimberely,Grant,KGRANT,011.44.1644.429263,2007-05-24,SA_REP,7000,0.15,149.0,NaN

#### What's the average salary in this company?

In [25]:
# your code here
employees.describe()

        employ_id        salary  commission_pct  manager_id  department_id
count  107.000000    107.000000       35.000000  106.000000     106.000000
mean   153.000000   6461.682243        0.222857  124.764151      63.207547
std     31.032241   3909.365746        0.085184   20.315395      20.910110
min    100.000000   2100.000000        0.100000  100.000000      10.000000
25%    126.500000   3100.000000        0.150000  108.000000      50.000000
50%    153.000000   6200.000000        0.200000  122.000000      50.000000
75%    179.500000   8900.000000        0.300000  145.000000      80.000000
max    206.000000  24000.000000        0.400000  205.000000     110.000000

#### What's the highest salary?

In [ ]:
# your code here
# 24000

#### What's the lowest salary?

In [ ]:
# your code here
# 2100

#### Who are the employees with the lowest salary?

In [28]:
# your code here
min_salary = employees["salary"].min()
employees[employees["salary"] == min_salary]

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
32,132,TJ,Olson,TJOLSON,650.124.8234,2007-04-10,ST_CLERK,2100,NaN,121.0,50.0

#### Find all the information about an employee called David.

In [33]:
# your code here
david = employees[employees["first_name"]== "David"]

#### Could you return only David's salary?

In [34]:
# your code here
david.salary

5     4800
51    9500
65    6800
Name: salary, dtype: int64

#### Print all the rows where job title is associate.

In [36]:
# your code here
employees["job_id"].unique()

array(['AD_PRES', 'AD_VP', 'IT_PROG', 'FI_MGR', 'FI_ACCOUNT', 'PU_MAN',
       'PU_CLERK', 'ST_MAN', 'ST_CLERK', 'SA_MAN', 'SA_REP', 'SH_CLERK',
       'AD_ASST', 'MK_MAN', 'MK_REP', 'HR_REP', 'PR_REP', 'AC_MGR',
       'AC_ACCOUNT'], dtype=object)

In [37]:
employees[employees["job_id"]== "AD_ASST"]

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
100,200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400,NaN,101.0,10.0

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [38]:
# Method 1
# your code here
employees.head(3)

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,NaN,100.0,90.0

In [41]:
# Method 2
# your code here
employees.iloc[0:3,:]

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,NaN,100.0,90.0

#### Find the employees whose title is associate and whose salary is above 55.

In [43]:
# your code here
employees[(employees["job_id"]== "AD_ASST") & (employees["salary"]> 55)]

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
100,200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400,NaN,101.0,10.0

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [55]:
# your code here
employees["years of employment"] = ((pd.Timestamp.now() - employees["hire_date"]).dt.days/365).astype("int64")

In [61]:
employees.groupby(["years of employment"])["salary"].mean()

years of employment
12     5576.470588
13     4555.555556
14     5882.142857
15     6933.333333
16     7263.636364
17     9920.000000
18     9633.333333
19    17000.000000
Name: salary, dtype: float64

####  What is the average salary per title?

In [87]:
# your code here
employees.groupby(["job_id"])[["salary"]].mean()

            salary
job_id
AC_ACCOUNT    8300
AC_MGR       12000
AD_ASST       4400
AD_PRES      24000
AD_VP        17000
FI_ACCOUNT    7920
FI_MGR       12000
HR_REP        6500
IT_PROG       5760
MK_MAN       13000
MK_REP        6000
PR_REP       10000
PU_CLERK      2780
PU_MAN       11000
SA_MAN       12200
SA_REP        8350
SH_CLERK      3215
ST_CLERK      2785
ST_MAN        7280

####  Find the salary quartiles.

In [63]:
# your code here
employees[["salary"]].describe()

             salary
count    107.000000
mean    6461.682243
std     3909.365746
min     2100.000000
25%     3100.000000
50%     6200.000000
75%     8900.000000
max    24000.000000

#### Is the mean salary different per gender?

In [ ]:
# your code here
# don't have the gender column

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [83]:
# your code here
detail_by_dept_min = employees.groupby(["job_id"]).min()._get_numeric_data()
detail_by_dept_min

,employ_id,salary,commission_pct,manager_id,department_id,years of employment
job_id,,,,,,
AC_ACCOUNT,206,8300,NaN,205.0,110.0,18
AC_MGR,205,12000,NaN,101.0,110.0,18
AD_ASST,200,4400,NaN,101.0,10.0,16
AD_PRES,100,24000,NaN,NaN,90.0,17
AD_VP,101,17000,NaN,100.0,90.0,14
FI_ACCOUNT,109,6900,NaN,108.0,100.0,12
FI_MGR,108,12000,NaN,101.0,100.0,18
HR_REP,203,6500,NaN,101.0,40.0,18
IT_PROG,103,4200,NaN,102.0,60.0,13
MK_MAN,201,13000,NaN,100.0,20.0,16
MK_REP,202,6000,NaN,201.0,20.0,15
PR_REP,204,10000,NaN,101.0,70.0,18
PU_CLERK,115,2500,NaN,114.0,30.0,13
PU_MAN,114,11000,NaN,100.0,30.0,17
SA_MAN,145,10500,0.2,100.0,80.0,12
SA_REP,150,6100,0.1,145.0,80.0,12
SH_CLERK,180,2500,NaN,120.0,50.0,12
ST_CLERK,125,2100,NaN,120.0,50.0,12
ST_MAN,120,5800,NaN,100.0,50.0,12

In [84]:
detail_by_dept_max = employees.groupby(["job_id"]).max()._get_numeric_data()
detail_by_dept_max

,employ_id,salary,commission_pct,manager_id,department_id,years of employment
job_id,,,,,,
AC_ACCOUNT,206,8300,NaN,205.0,110.0,18
AC_MGR,205,12000,NaN,101.0,110.0,18
AD_ASST,200,4400,NaN,101.0,10.0,16
AD_PRES,100,24000,NaN,NaN,90.0,17
AD_VP,102,17000,NaN,100.0,90.0,19
FI_ACCOUNT,113,9000,NaN,108.0,100.0,18
FI_MGR,108,12000,NaN,101.0,100.0,18
HR_REP,203,6500,NaN,101.0,40.0,18
IT_PROG,107,9000,NaN,103.0,60.0,15
MK_MAN,201,13000,NaN,100.0,20.0,16
MK_REP,202,6000,NaN,201.0,20.0,15
PR_REP,204,10000,NaN,101.0,70.0,18
PU_CLERK,119,3100,NaN,114.0,30.0,17
PU_MAN,114,11000,NaN,100.0,30.0,17
SA_MAN,149,14000,0.40,100.0,80.0,15
SA_REP,179,11500,0.35,149.0,80.0,16
SH_CLERK,199,4200,NaN,124.0,50.0,16
ST_CLERK,144,3600,NaN,124.0,50.0,17
ST_MAN,124,8200,NaN,100.0,50.0,17

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [88]:
# your code here
employees.groupby(["job_id"])[["salary"]].max() - employees.groupby(["job_id"])[["salary"]].min()

            salary
job_id
AC_ACCOUNT       0
AC_MGR           0
AD_ASST          0
AD_PRES          0
AD_VP            0
FI_ACCOUNT    2100
FI_MGR           0
HR_REP           0
IT_PROG       4800
MK_MAN           0
MK_REP           0
PR_REP           0
PU_CLERK       600
PU_MAN           0
SA_MAN        3500
SA_REP        5400
SH_CLERK      1700
ST_CLERK      1500
ST_MAN        2400

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here